[1]	M. B. Khan et al. 2018. Image Processing and Analysis of Phase-Contrast Microscopic Images of Activated Sludge to Monitor the Wastewater Treatment Plants. IEEE Access. 6, 4 (2018), 1778-1791. DOI:https://doi.org/10.1109/ACCESS.2017.2780249.

[2]	B. Dai et al. 2018. Image Processing Unit for General-Purpose Representation and Association System for Recognizing Low-Resolution Digits With Visual Information Variability. IEEE Transactions on Systems, Man, and Cybernetics: Systems. 48, 3 (2018), 317-328. DOI:https://doi.org/10.1109/TSMC.2016.2601902.

[3]	P. Morales-Ã?lvarez et al. 2018. Remote Sensing Image Classification With Large-Scale Gaussian Processes. IEEE Transactions on Geoscience and Remote Sensing. 56, 2 (2018), 1103-1114. DOI:https://doi.org/10.1109/TGRS.2017.2758922.

[4]	T. Y. Hsieh et al. 2018. Structural Variance-Based Error-Tolerability Test Method for Image Processing Applications. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems. 37, 2 (2018), 485-498. DOI:https://doi.org/10.1109/TCAD.2017.2705050.

[5]	P. Ghamisi et al. 2017. Advances in Hyperspectral Image and Signal Processing: A Comprehensive Overview of the State of the Art. IEEE Geoscience and Remote Sensing Magazine. 5, 4 (2017), 37-78. DOI:https://doi.org/10.1109/MGRS.2017.2762087.

[6]	S. X. Zhang et al. 2018. Characteristics Analysis and Image Processing for Full-Polarization Synthetic Aperture Radar Based on Electromagnetic Scattering From Flat Horizontal Perfect Electric Conducting Reflector. IEEE Transactions on Geoscience and Remote Sensing. 56, 1 (2018), 313-327. DOI:https://doi.org/10.1109/TGRS.2017.2747578.

[7]	U. A. Nnolim et al. 2017. Improved partial differential equation-based enhancement for underwater images using local #8211;global contrast operators and fuzzy homomorphic processes. IET Image Processing. 11, 11 (2017), 1059-1067. DOI:https://doi.org/10.1049/iet-ipr.2017.0259.

[8]	E. Kalali et al. 2017. Low complexity 2D adaptive image processing algorithm and its hardware implementation. IEEE Transactions on Consumer Electronics. 63, 3 (2017), 277-284. DOI:https://doi.org/10.1109/TCE.2017.014996.

[9]	C. Jiang et al. 2017. Image Processing of Aluminum Alloy Weld Pool for Robotic VPPAW Based on Visual Sensing. IEEE Access. 5, 3 (2017), 21567-21573. DOI:https://doi.org/10.1109/ACCESS.2017.2761986.

[10]	G. Wu et al. 2017. Light Field Image Processing: An Overview. IEEE Journal of Selected Topics in Signal Processing. 11, 7 (2017), 926-954. DOI:https://doi.org/10.1109/JSTSP.2017.2747126.

[11]	Z. Lv et al. 2017. Guest Editorial: Advances in Big Data Methods for Image Processing. IET Image Processing. 11, 10 (2017), 803-804. DOI:https://doi.org/10.1049/iet-ipr.2017.0974.

