[1]	H. C. Kim et al. 2010. Performance impact of large file transfer on web proxy caching: A case study in a high bandwidth campus network environment. Journal of Communications and Networks. 12, 1 (2010), 52-66. DOI:https://doi.org/10.1109/JCN.2010.6388434.

[2]	M. Hefeeda et al. 2010. On the Benefits of Cooperative Proxy Caching for Peer-to-Peer Traffic. IEEE Transactions on Parallel and Distributed Systems. 21, 7 (2010), 998-1010. DOI:https://doi.org/10.1109/TPDS.2009.130.

[3]	W. Tu et al. 2009. Proxy Caching for Video-on-Demand Using Flexible Starting Point Selection. IEEE Transactions on Multimedia. 11, 4 (2009), 716-729. DOI:https://doi.org/10.1109/TMM.2009.2017621.

[4]	J. P. G. Ortiz et al. 2008. Interactive Transmission of JPEG2000 Images Using Web Proxy Caching. IEEE Transactions on Multimedia. 10, 4 (2008), 629-636. DOI:https://doi.org/10.1109/TMM.2008.921738.

[5]	C. L. Chan et al. 2007. Performance Analysis of Proxy Caching for VOD Services With Heterogeneous Clients. IEEE Transactions on Communications. 55, 11 (2007), 2142-2151. DOI:https://doi.org/10.1109/TCOMM.2007.908524.

[6]	C. F. Kao et al. 2007. Aggregate Profit-Based Caching Replacement Algorithms for Streaming Media Transcoding Proxy Systems. IEEE Transactions on Multimedia. 9, 2 (2007), 221-230. DOI:https://doi.org/10.1109/TMM.2006.886259.

[7]	J. Z. Wang et al. 2007. Fragmental Proxy Caching for Streaming Multimedia Objects. IEEE Transactions on Multimedia. 9, 1 (2007), 147-156. DOI:https://doi.org/10.1109/TMM.2006.886379.

[8]	A. T. s. Ip et al. 2007. COPACC: An Architecture of Cooperative Proxy-Client Caching System for On-Demand Media Streaming. IEEE Transactions on Parallel and Distributed Systems. 18, 1 (2007), 70-83. DOI:https://doi.org/10.1109/TPDS.2007.253282.

[9]	Songqing Chen et al. 2005. Segment-based proxy caching for Internet streaming media delivery. IEEE MultiMedia. 12, 3 (2005), 59-67. DOI:https://doi.org/10.1109/MMUL.2005.56.

[10]	Kun-Lung Wu et al. 2004. Segmentation of multimedia streams for proxy caching. IEEE Transactions on Multimedia. 6, 5 (2004), 770-780. DOI:https://doi.org/10.1109/TMM.2004.834870.

