[1]	B. Dietrich et al. 2015. Time Series Characterization of Gaming Workload for Runtime Power Management. IEEE Transactions on Computers. 64, 1 (2015), 260-273. DOI:https://doi.org/10.1109/TC.2013.198.

[2]	G. C. Burdea et al. 2013. Robotics and Gaming to Improve Ankle Strength, Motor Control, and Function in Children With Cerebral Palsy #x2014;A Case Study Series. IEEE Transactions on Neural Systems and Rehabilitation Engineering. 21, 2 (2013), 165-173. DOI:https://doi.org/10.1109/TNSRE.2012.2206055.

[3]	T. G. Papaioannou et al. 2018. Optimal Design of Serious Games for Consumer Engagement in the Smart Grid. IEEE Transactions on Smart Grid. 9, 2 (2018), 1241-1249. DOI:https://doi.org/10.1109/TSG.2016.2582298.

[4]	J. Zhang et al. 2018. Structural Attack on Reduced-Round Skipjack. IEEE Access. 6, 5 (2018), 3176-3183. DOI:https://doi.org/10.1109/ACCESS.2017.2787575.

[5]	T. S. Babu et al. 2018. Particle Swarm Optimization Based Solar PV Array Reconfiguration of the Maximum Power Extraction Under Partial Shading Conditions. IEEE Transactions on Sustainable Energy. 9, 1 (2018), 74-85. DOI:https://doi.org/10.1109/TSTE.2017.2714905.

[6]	T. Wang et al. 2017. An Efficient Online Algorithm for Dynamic SDN Controller Assignment in Data Center Networks. IEEE/ACM Transactions on Networking. 25, 5 (2017), 2788-2801. DOI:https://doi.org/10.1109/TNET.2017.2711641.

[7]	A. Khitun et al. 2017. Two-Dimensional Oscillatory Neural Network Based on Room-Temperature Charge-Density-Wave Devices. IEEE Transactions on Nanotechnology. 16, 5 (2017), 860-867. DOI:https://doi.org/10.1109/TNANO.2017.2716845.

[8]	H. Li et al. 2017. Stochastic set stabilisation of n-person random evolutionary Boolean games and its applications. IET Control Theory Applications. 11, 13 (2017), 2152-2160. DOI:https://doi.org/10.1049/iet-cta.2017.0047.

[9]	Y. Zheng et al. 2017. Online Cloud Transcoding and Distribution for Crowdsourced Live Game Video Streaming. IEEE Transactions on Circuits and Systems for Video Technology. 27, 8 (2017), 1777-1789. DOI:https://doi.org/10.1109/TCSVT.2016.2556584.

[10]	S. N. Mathaudhu et al. 2017. Superheroes and Scientists as Agents for Societal and Technological Advancement. IEEE Potentials. 36, 4 (2017), 24-29. DOI:https://doi.org/10.1109/MPOT.2017.2694298.

