[1]	G. M. Tang et al. 2018. Logic Design of a 16-bit Bit-Slice Arithmetic Logic Unit for 32-/64-bit RSFQ Microprocessors. IEEE Transactions on Applied Superconductivity. 28, 4 (2018), 1-5. DOI:https://doi.org/10.1109/TASC.2018.2799994.

[2]	A. Leva et al. 2018. Event-Based Power/Performance-Aware Thermal Management for High-Density Microprocessors. IEEE Transactions on Control Systems Technology. 26, 2 (2018), 535-550. DOI:https://doi.org/10.1109/TCST.2017.2675841.

[3]	M. Fyrbiak et al. 2018. Hybrid Obfuscation to Protect Against Disclosure Attacks on Embedded Microprocessors. IEEE Transactions on Computers. 67, 3 (2018), 307-321. DOI:https://doi.org/10.1109/TC.2017.2649520.

[4]	T. Adegbija et al. 2018. Microprocessor Optimizations for the Internet of Things: A Survey. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems. 37, 1 (2018), 7-20. DOI:https://doi.org/10.1109/TCAD.2017.2717782.

[5]	X. Li et al. 2017. Heuristic thermal sensor allocation methods for overheating detection of real microprocessors. IET Circuits, Devices Systems. 11, 6 (2017), 559-567. DOI:https://doi.org/10.1049/iet-cds.2016.0529.

[6]	T. Kim et al. 2017. Energy and Lifetime Optimizations for Dark Silicon Manycore Microprocessor Considering Both Hard and Soft Errors. IEEE Transactions on Very Large Scale Integration (VLSI) Systems. 25, 9 (2017), 2561-2574. DOI:https://doi.org/10.1109/TVLSI.2017.2707401.

[7]	F. M. Lins et al. 2017. Register File Criticality and Compiler Optimization Effects on Embedded Microprocessor Reliability. IEEE Transactions on Nuclear Science. 64, 8 (2017), 2179-2187. DOI:https://doi.org/10.1109/TNS.2017.2705150.

[8]	A. Aloisio et al. 2017. uSOP: A Microprocessor-Based Service-Oriented Platform for Control and Monitoring. IEEE Transactions on Nuclear Science. 64, 6 (2017), 1185-1190. DOI:https://doi.org/10.1109/TNS.2017.2707444.

[9]	M. OmaÃa et al. 2017. New Approaches for Power Binning of High Performance Microprocessors. IEEE Transactions on Computers. 66, 7 (2017), 1159-1171. DOI:https://doi.org/10.1109/TC.2017.2655060.

