G. M. Tang, P. Y. Qu, X. C. Ye, D. R. Fan. "Logic Design of a 16-bit Bit-Slice Arithmetic Logic Unit for 32-/64-bit RSFQ Microprocessors", IEEE Transactions on Applied Superconductivity, vol. 28, no. 4, p. 1-5, June 2018.

A. Leva, F. Terraneo, I. Giacomello, W. Fornaciari. "Event-Based Power/Performance-Aware Thermal Management for High-Density Microprocessors", IEEE Transactions on Control Systems Technology, vol. 26, no. 2, p. 535-550, March 2018.

M. Fyrbiak, S. Rokicki, N. Bissantz, R. Tessier, C. Paar. "Hybrid Obfuscation to Protect Against Disclosure Attacks on Embedded Microprocessors", IEEE Transactions on Computers, vol. 67, no. 3, p. 307-321, March 2018.

T. Adegbija, A. Rogacs, C. Patel, A. Gordon-Ross. "Microprocessor Optimizations for the Internet of Things: A Survey", IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol. 37, no. 1, p. 7-20, Jan 2018.

X. Li, X. Wei, W. Zhou. "Heuristic thermal sensor allocation methods for overheating detection of real microprocessors", IET Circuits, Devices Systems, vol. 11, no. 6, p. 559-567, Jan 2017.

T. Kim, Z. Sun, H. B. Chen, H. Wang, S. X. D. Tan. "Energy and Lifetime Optimizations for Dark Silicon Manycore Microprocessor Considering Both Hard and Soft Errors", IEEE Transactions on Very Large Scale Integration (VLSI) Systems, vol. 25, no. 9, p. 2561-2574, Sept 2017.

F. M. Lins, L. A. Tambara, F. L. Kastensmidt, P. Rech. "Register File Criticality and Compiler Optimization Effects on Embedded Microprocessor Reliability", IEEE Transactions on Nuclear Science, vol. 64, no. 8, p. 2179-2187, Aug 2017.

A. Aloisio, F. Ameli, A. Anastasio, P. Branchini, F. Di Capua, R. Giordano, V. Izzo, G. Tortone. "uSOP: A Microprocessor-Based Service-Oriented Platform for Control and Monitoring", IEEE Transactions on Nuclear Science, vol. 64, no. 6, p. 1185-1190, June 2017.

M. OmaÃa, M. Padovani, K. Veliu, C. Metra, J. Alt, R. Galivanche. "New Approaches for Power Binning of High Performance Microprocessors", IEEE Transactions on Computers, vol. 66, no. 7, p. 1159-1171, July 2017.

